namespace AirFramework
{
    public unsafe interface IUnsafeOut
    {
        /****************************************************************************
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         ****************************************************************************/
    }
    public unsafe interface IUnsafeIn
    {
        /****************************************************************************
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
         ****************************************************************************/
    }
}
