/********************************************************************************************
 * Author: YueZhenpeng
 * Date : 2023.1.30
 * Description : 派发器协变接，为实现泛型约束
 ********************************************************************************************/

namespace AirFramework
{

    public interface IDispatcherOut<out T> : IUnsafeOut where T : IMessage
    {
        /****************************************************************************
        * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
        * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
        * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
        * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
        * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
        * 警告:此处定义的任何成员严格禁止被访问！！！否则可能引发程序直接崩溃！！！*
        ****************************************************************************/
    }

}
